{"keras_version": "2.1.5", "backend": "tensorflow", "config": [{"config": {"activation": "tanh", "recurrent_constraint": null, "name": "lstm_4", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "return_sequences": true, "batch_input_shape": [null, 50, 1], "return_state": false, "trainable": true, "unroll": false, "implementation": 1, "activity_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "units": 50, "dtype": "float32", "dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "bidirectional_1", "trainable": true, "merge_mode": "concat", "layer": {"config": {"activation": "tanh", "recurrent_constraint": null, "name": "lstm_5", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "return_sequences": true, "bias_constraint": null, "return_state": false, "trainable": true, "unroll": false, "implementation": 1, "activity_regularizer": null, "unit_forget_bias": true, "units": 50, "stateful": false, "dropout": 0.0, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "time_distributed_1", "layer": {"config": {"bias_constraint": null, "name": "dense_2", "units": 1, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}, {"config": {"bias_constraint": null, "name": "dense_3", "units": 1, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}